//-----------------------------------------------------------------------------
// 自己制作補助用ライブラリ
// 制　作　者：22CI0333 長谷川勇一朗
// 制作年月日：2023/4/13
// 概　　　要：制作用です。
//-----------------------------------------------------------------------------
#include "myLib.h"

#pragma once

namespace Assist {//制作支援

    //-------------------------------------------------------------------------
    // BoxCentering関数
    // 矩形オブジェクトを中心基準として使用する際に使用する。
    // 以下の場面で使用する
    // 使用場面）ML::Box2D hitBase(-32,-32, 64, 64);
    // 使用　例）ML::Box2D hitBase = Assist::BoxCentering(64,64); 
    //-------------------------------------------------------------------------

    ML::Box2D BoxCentering(int w_, int h_);
    ML::Box2D BoxCentering(int x_, int y_, int w_, int h_);
    ML::Box2D BoxCentering(ML::Vec2 pos_, int w_, int h_);
}

